<script>
import './Group.scss';
import PhotoSlider from "@/components/PhotoSlider/PhotoSlider.vue";
import User from "@/components/User.vue";
  export default {
    name: "Group",
    components: {PhotoSlider, User},
    data() {
      return {
        isActive: true,
        userList: [
          {name: "Иван Абрамов"},
          {name: "Иван Иванов"},
        ]
      }
    },
    methods: {
      toggleState() {
        this.isActive = !this.isActive
      }
    }
  }
</script>


<template>
  <div class="container">
    <div class="group">
      <PhotoSlider />

      <div class="group__check">
        <div class="block">
          <h4 class="group__heading">Групповое занятие</h4>
          <div class="group__info">
            <div class="group__date">
              <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" fill="none" viewBox="0 0 14 14">
                <g clip-path="url(#a)">
                  <path fill="#175FFF" d="M7 7.382a.536.536 0 1 0 .536.536A.52.52 0 0 0 7 7.382Zm2.498 0a.536.536 0 1 0 .535.536.52.52 0 0 0-.535-.536Zm-4.995 0a.536.536 0 1 0 .537.537.52.52 0 0 0-.537-.537ZM7 9.85a.536.536 0 1 0 .536.535A.52.52 0 0 0 7 9.85Zm2.498 0a.536.536 0 1 0 .535.535.521.521 0 0 0-.535-.535Zm-4.995 0a.536.536 0 1 0 .537.535.518.518 0 0 0-.537-.535Z"/>
                  <path fill="#175FFF" d="M10.695.911h-.887V.535A.573.573 0 0 0 9.268 0a.536.536 0 0 0-.537.535v.376h-3.46V.535A.573.573 0 0 0 4.728 0a.536.536 0 0 0-.535.535v.376h-.886A3.31 3.31 0 0 0 0 4.221v6.47A3.315 3.315 0 0 0 3.307 14h7.388A3.308 3.308 0 0 0 14 10.691v-6.47a3.314 3.314 0 0 0-3.305-3.31Zm0 12.017H3.307A2.235 2.235 0 0 1 1.07 10.69V5.676h11.86v5.015a2.24 2.24 0 0 1-2.234 2.237ZM3.307 1.983h.886v.401a.573.573 0 0 0 .535.537.538.538 0 0 0 .537-.537v-.4H8.73v.4a.574.574 0 0 0 .536.537.536.536 0 0 0 .535-.537v-.4h.887a2.237 2.237 0 0 1 2.24 2.237v.383H1.07v-.383a2.242 2.242 0 0 1 2.236-2.238Z"/>
                </g>
                <defs>
                  <clipPath id="a">
                    <path fill="#fff" d="M0 0h14v14H0z"/>
                  </clipPath>
                </defs>
              </svg>
              14.07.2024 15:30
            </div>
            <div class="group__time">
              <svg xmlns="http://www.w3.org/2000/svg" width="16" height="10" fill="none" viewBox="0 0 16 10">
                <path fill="#175FFF" d="M11.608 3.024c-.356 0-.645-.268-.645-.6 0-.33.29-.6.645-.6a4.55 4.55 0 0 1 3.1 1.201l.004.004C15.507 3.77 16 4.79 16 5.912c0 1.125-.494 2.147-1.29 2.888a4.548 4.548 0 0 1-3.102 1.2H4.393a4.548 4.548 0 0 1-3.1-1.2l-.003-.003C.494 8.057 0 7.035 0 5.912c0-1.125.494-2.147 1.29-2.888a4.548 4.548 0 0 1 3.102-1.2h3.253l-.86-.8a.57.57 0 0 1 0-.848.679.679 0 0 1 .912 0l1.947 1.812a.5.5 0 0 1 .046.046l.008.009.003.003.007.008.003.003.006.008.003.004.006.008.003.004.009.013.005.006.004.006a.66.66 0 0 1 .056.105l.002.006.003.008a.564.564 0 0 1 0 .397l-.003.008-.002.005a.614.614 0 0 1-.056.106l-.004.006-.005.006-.009.012-.003.005-.006.008-.003.004-.006.008-.003.003-.007.008-.003.003-.008.009c-.015.016-.03.032-.046.046L7.697 4.671a.679.679 0 0 1-.912 0 .57.57 0 0 1 0-.848l.86-.8H4.392c-.853 0-1.629.325-2.192.848-.562.524-.912 1.246-.912 2.04 0 .795.35 1.517.911 2.04a3.215 3.215 0 0 0 2.193.848h7.215a3.21 3.21 0 0 0 2.191-.849 2.782 2.782 0 0 0 .912-2.04 2.78 2.78 0 0 0-.91-2.039l-.002-.002a3.21 3.21 0 0 0-2.19-.846v.001Z"/>
              </svg>
              Еженедельно
            </div>

          </div>
          <div class="group__btn">
            <button
                :class="['btn', { 'btn-icon': !isActive, 'btn-disabled': !isActive }]"
                @click="toggleState">
              <svg v-if="!isActive" xmlns="http://www.w3.org/2000/svg" width="17" height="17" fill="none" viewBox="0 0 17 17">
                <path fill="#175FFF" d="M11.43 6.293a.702.702 0 0 0-.992 0L7.5 9.215l-.94-.947a.703.703 0 0 0-1 .988l1.437 1.447a.703.703 0 0 0 .993.002l3.437-3.417a.707.707 0 0 0 .005-.991l-.001-.004Z"/>
                <path fill="#175FFF" d="M16.326 5.193a8.512 8.512 0 0 0-1.822-2.701A8.512 8.512 0 0 0 11.802.669 8.42 8.42 0 0 0 8.497 0C3.812.002 0 3.814 0 8.498c0 4.685 3.812 8.497 8.497 8.497 4.684 0 8.496-3.812 8.496-8.497a8.419 8.419 0 0 0-.667-3.305ZM8.496 15.59a7.1 7.1 0 0 1-7.09-7.092 7.1 7.1 0 0 1 7.09-7.091 7.1 7.1 0 0 1 7.092 7.091 7.1 7.1 0 0 1-7.091 7.092Z"/>
              </svg>
              {{isActive ? 'Я пойду' : 'Вы пойдете'}}
            </button>
          </div>
        </div>
      </div>

      <h3 class="group__title">Группа</h3>
      <ul class="users__list queue-users group__user">
        <li v-for="(item, index) in userList" :key="index">
          <User :photo="item.photo" :name="item.name" :date="item.date" :count="item.count" />
        </li>
      </ul>
    </div>
  </div>
</template>
